Repository: magi1125/inclusive-design-pattern
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Content should be available to users who do not have JavaScript running or for whom JavaScript has thrown an error, been blocked or failed to load.
ja: コンテンツは、JavaScriptが無効になっているユーザーや、JavaScriptがエラーになったり、ブロックされたり、読み込めなかった場合でも利用できるようにすべきです。

source: Content that works well in different contexts and via different inputs can be said to be interoperable.
ja: さまざまなコンテキストで、さまざまな入力を介して問題なく機能するコンテンツは、相互運用性があると言うことができます。

source: Contrast
ja: コントラスト

source: Conventional practice is to describe the page and append author and site information.
ja: 一般的にはページの説明に、制作者とサイトの情報を付け加えます。

source: Conventional wisdom says screen reader users but, as I’ve already covered, they have other means to reach the <main> element.
ja: 典型的な答えは、スクリーンリーダーユーザーのためというものでした。しかし前述のように、スクリーンリーダーユーザーが<main>要素に移動する手段は他にもあります。

source: Conversational English for consumers.
ja: 日常会話に使われる英語。

source: Copywriting requires design just as much as form and composition, but in a culture dominated by visual design it tends to be put to one side; deferred until frankly less important decisions about aesthetics and ornamentation have been settled.
ja: コピーライティングは、様式や構図と同じくらいデザインを必要としますが、ビジュアルデザインが優位にある文化の中で、後回しにされがちです。実のところ、コピーライティングより重要性の低い、見た目の美しさや装飾が決定されるまで保留されてしまいます。

source: Descenders are not crossed thanks to a text shadow which protects the letterforms like a moat protects a castle.
ja: テキストシャドウのおかげでアンダーラインはディセンダを横切らず、まるで堀が城を護っているかのように文字が保護されています。

source: Designing inclusively is to support as many of these as possible and provide alternative content and interaction mechanisms where this isn’t possible.
ja: インクルーシブにデザインするということは、これらをできるだけ広くサポートし、それが不可能な場合には、代替のコンテンツやインタラクションメカニズムを提供することです。

source: Desktop browsers tend to render fonts at 16px by default.
ja: デスクトップのブラウザでは、デフォルトのフォントサイズはたいてい16pxです。

source: Despite the inclusion of nestable sectioning elements in the HTML5 specification, like <section>, the only elements currently able to describe depth in an inclusive fashion are to .
ja: HTML5仕様には<section>などのネスト可能なセクショニング要素が含まれていますが、現在のところ、インクルーシブな方法で階層の深さを記述できる要素は ～だけです。

source: Diagram labels your interface hidden among all the browser interface elements.
ja: すべてのブラウザインターフェイス要素の中で、あなたがデザインするインターフェイスにラベルが付けられている図。

source: Difficult to read.
ja: 読みにくい。

source: Direct, descriptive headings clarify the ensuing content, which aids comprehension across the board.
ja: 直接的で記述的な見出しは、あとに続く内容を明確にし、全体的な理解も助けます。

source: Do not make the mistake of converting theoretical rem units into pixels via a CSS preprocessor.
ja: CSSプリプロセッサでremをピクセルに変換するという過ちを犯さないように注意してください。

source: Don’t Buy Into The Hype7,” the creator of the Lucida typeface, Chuck Bigelow, corroborates these findings with his own research.
ja: Don’t Buy Into The Hype（脚注21）」で、自身の調査によってこの説を裏づけています。

source: Easily understood by 13- to 15-year-old students.
ja: 平均的な13～15才の生徒が容易に理解できる。

source: Easily understood by an average 11-year-old student.
ja: 平均的な11才の生徒が容易に理解できる。

source: Easy to read.
ja: 読みやすい。

source: Essentially, this means you can employ implicitly responsive text without the need for media queries like that of the previous code example.
ja: つまり、前出のコード例のようなメディアクエリを用いずにレスポンシブなテキストを使用できるというわけです。

source: Even so, if links are not styled so their focus state is indicated, it’s impossible for the user to see which element is indeed in current focus.
ja: とはいえ、リンクにフォーカス状態を示すスタイルが適用されていなければ、ユーザーには現在どの要素がフォーカスされているのかわかりません。

source: Fairly difficult to read.
ja: わりと読みにくい。

source: Fairly easy to read.
ja: わりと読みやすい。

source: Finally JavaScript is put on top, but content is still there.
ja: 最後にJavaScriptが加わるが、コンテンツは依然として維持される。

source: Finding the right solution depends on what we want to achieve.
ja: 正しい解決策は、何を行いたいかによります。

source: Firefox, for instance, changes dictionaries on <textarea>s so that spelling errors are highlighted appropriately.
ja: たとえばFirefoxでは、<textarea>でスペルミスをハイライト表示する際の辞書が切り替えられます。

source: Flesch-Kincaid Readability Tests
ja: Flesch-Kincaid リーダビリティテスト

source: Focusing the skip link reveals it visually, giving the user the option of skipping to the main content if so desired.
ja: フォーカスがあたるとスキップリンクが画面に表示され、ユーザーは必要に応じてメインコンテンツにジャンプできるようになります。

source: Folks who update and maintain websites can be non-technical and frequently have no confidence (nor interest) in visual design.
ja: Webサイトの更新や運用を行う人々の中には、技術に詳しくなかったり、ビジュアルデザインに自信がない（そもそも興味がない）人もいます。

source: Font Face Observer allows you to watch and wait on the completion of a font resource loading using a simple promise-based interface:
ja: このFont Face Observerを使えば、フォントリソースの読み込みを監視して読み込み完了を待つ処理を、シンプルなPromiseベースのインターフェイスで以下のように書くことができます。

source: Font Size
ja: フォントサイズ

source: For a short time, the <hgroup> element was the prescribed solution.
ja: 一時は、<hgroup>要素が規定の解決策でした。

source: For example, a developer might choose an in place of an because they deem the section unimportant and would like to reduce the font-size accordingly.
ja: たとえば、そのセクションが重要ではないと判断し、font-sizeを小さくしたいと考えて、ではなくを選択することがあります。

source: For example, if you know your headings will use just the uppercase letters from a particular font, you can include the link like so:
ja: たとえば、見出しで特定フォントの大文字だけを使うとわかっている場合、link要素を以下のように書くことができます。

source: For example, in testing I’ve experienced a screen reader producing erroneous output as it struggled to parse a massive DOM.
ja: たとえば、私がテストをしていたときに、スクリーンリーダーが複雑なDOMの解析に苦労し、誤った出力をしたことがありました。

source: For example, where I increase the font size for wider desktop screens, the measure — which is defined using a unit relative to the font size (rem) — also increases.
ja: 例として、幅が広いデスクトップの画面でフォントサイズを大きくしたい場合、このカラム幅――フォントサイズに相対的な単位（rem）で定義された値――が一緒に大きくなってくれます。

source: For example, you may be asking, “If this is an article, shouldn’t it be in an <article> element?”
ja: たとえば、「これが記事（article）だというなら、<article>要素に入れるべきではないか？」と思われるかもしれません。

source: For example, “Inclusive Design Template | Heydon’s Site.” For a search results page, you should include the search term the user provided; something like, “[Website name] | Search results for [search phrase].”
ja: たとえば「インクルーシブデザインテンプレート | ヘイドンのサイト」といった具合です。検索結果のページの場合は、「[Webサイト名] | [検索語句]の検索結果」のように、ユーザーが入力した検索語句を含めるようにしましょう。

source: For example, “The Blog Post” will cover testing content readability against the Flesch-Kincaid scale22.
ja: たとえば「ブログ記事」の章では、Flesch-Kincaidスケール（脚注36）を指標としたコンテンツの読みやすさのテストについて触れています。

source: For good readability without JavaScript dependencies and their attendant performance issues, the default text-align value of left is preferable.
ja: JavaScriptへの依存や、それに付随するパフォーマンス問題を避けつつ読みやすくするためには、text-alignのデフォルトの値であるleftを使用することが好ましいでしょう。

source: For instance, lang="zh-Hans" will invoke the rendering of a simplified Chinese font.
ja: たとえば、lang="zh-Hans”と指定すると、簡体字中国語のフォントで表示されます。

source: For instance, I may want to quote some French within an English language page:
ja: たとえば、英語のページの中でフランス語を引用したい場合は、以下のようにします。

source: For instance, if the font size was 16px, the leading should be at least 24px.
ja: たとえば、フォントサイズが16pxだった場合、行送りを24px以上にします。

source: For instance, in NVDA, I can open the Elements List dialog with Insert + F7 and browse a list of headings on the page.
ja: たとえば、NVDAでは、Insert + F7キーで＃＃Elements List＃＃ダイアログを開き、ページの見出しのリストを見ることができます。

source: For instance, your <main> element should be set with an appropriate max-width.
ja: たとえば、<main>要素に適切なmax-widthを指定すると良いでしょう。

source: For now, note this down: everything but content is an enhancement.
ja: ここではまず、コンテンツ以外のすべては補強である、ということを覚えておいてください。

source: For the purposes of inclusive design, sometimes our text has to have a certain autonomy as well.
ja: インクルーシブデザインでは、テキストにある程度の自律性が求められる場合があります。

source: For this reason, all browsers render text with text-decoration: underline by default, making inline link design a classic case of doing nothing being a perfectly good resolution.
ja: この理由から、すべてのブラウザはデフォルトでtext-decoration: underlineを適用してリンクテキストを表示します。そのため、インラインリンクのデザインは、何もしないのが完璧に良い解決策であるという典型例になります。

source: For this to work, the fonts will have to be base64-encoded and embedded into the style sheet in question.
ja: そのためには、フォントはBase64でエンコードし、当該のスタイルシートに埋め込む必要があります。

source: Free tools like Contrast-A11 (requires Flash) and Color Safe12 are available to help you there.
ja: これには、フリーツールのContrast-A（脚注25）（Flashが必要）やColor Safe（脚注26）などが役立ちます。

source: Garbled text, rendered in unbefitting characters is not optimally inclusive of your readership to say the least.
ja: 不適切な文字で文字化けしたテキストは、いくら控えめに言っても、閲覧者に最適なインクルーシブなものとは言えません。

source: Generous ascenders (e.g. the vertical line in d) and descenders (e.g. the down-pointing line in y) proved popular among dyslexic readers in their research.
ja: 彼らの研究では、アセンダ（dの縦線など）とディセンダ（yの下向きの線など）が大きい方が、ディスレクシア（難読症）の人たちにとって読みやすいことがわかりました。

source: Good semantic structure works well with screen readers, feed readers, search engines and all sorts of other parsers looking for structural meaning in your content.
ja: 優れたセマンティック構造は、スクリーンリーダー、フィードリーダー、サーチエンジン、およびコンテンツ内の構造的な意味を探る他のあらゆるパーサーで適切に扱うことができます。

source: HTML pages vary dramatically in shape and size, and can include any combination of patterns; but there are a handful of document-level best practices we should stick to.
ja: HTMLページは形もサイズも実にさまざまにでき、その中身にはあらゆるパターンの組み合わせを入れることができます。しかし、ドキュメント全体のレベルで従うべきベストプラクティスがいくつか存在します。

source: Having chosen an inclusive typeface, we ought to do it justice with good composition.
ja: インクルーシブな書体を選択したら、優れた文字組みでその良さを発揮させる必要があります。

source: Having such a utility class in your style sheet and at your disposal is always recommended.
ja: このようなユーティリティクラスをスタイルシートに用意し、自由に使えるようにしておくことをおすすめします。

source: Heading And Link Text
ja: 見出しとリンクテキスト

source: Heading Structure
ja: 見出しの構造

source: Heading elements in particular derive much of their meaning from their relationships with one another.
ja: 特に見出し要素は、意味の多くが互いの関係性からもたらされます。

source: Headings, for instance, will appear in bold text and have font sizes indicative of the section depth they represent.
ja: たとえば、見出しは太字テキストで表示され、セクションの深さを示すフォントサイズになります。

source: Here is my adapted version:
ja: 以下は私が手を加えたバージョンです。

source: Here, we’ll investigate the composition of an inclusive blog post as found at its permalink, forming the principal content of the parent page.
ja: ここでは、インクルーシブなブログ記事の構成について探りましょう。ブログ記事はパーマリンクで見ることができ、親ページの主要なコンテンツを構成する要素でもあります。

source: Here’s a summary from the tests’ Wikipedia page14:
ja: 以下は、このテストのWikipediaでの解説ページ（脚注47）からの要約です。

source: Here’s the thing: in a world of artifice and ornamentation, utility is radical.
ja: つまりこういうことです。技巧と装飾の世界においては、実用性こそが根本なのです。

source: Here’s what it will return:
ja: 以下が返されます。

source: How To Mark Up Blog Articles <span>In Seven Easy Steps</span> </h1>
ja: ブログ記事のマークアップ方法 <span>～シンプルな7つのステップで～</span> </h1>

source: How these underlying technologies actually interact with your users will be the focus throughout (alongside organizational and writing techniques that benefit users too, of course).
ja: こうした基本的な技術をユーザーが実際にどのように利用することになるのか。それを常に考えなければなりません（もちろん、ユーザーにメリットのある構成や記述のテクニックも大切です）。

source: However, you should not be building a highly complex layout.
ja: しかし、非常に複雑なレイアウトは構築すべきでないのです。

source: However, as stated earlier in “The Document,” it’s rarely advisable to use fixed units like pixels because it makes managing comfortable proportions a headache.
ja: しかし、先ほど「ドキュメント全体」で説明した通り、通常は、ピクセルなどの固定の単位の使用は推奨されません。読みやすい比率を維持するのが難しくなるからです。

source: However, it is not implemented in any user agent3, and there’s no sign it ever will be.
ja: しかし、これはどのユーザーエージェントにも実装されておらず（脚注38）、今後実装されそうな兆候もありません。

source: However, it’s important not to think about extreme cases in isolation and to target specific groups.
ja: ただし重要なことは、極端なケースを分離して考えないこと、そして特定のグループをターゲットにしないことです。

source: However, there can be an unpleasant and disorienting jump when the web font supplants the system font after it has loaded.
ja: ただし、Webフォントが読み込まれたタイミングでシステムフォントがWebフォントに置き換わると、ページの表示位置が突然飛んで、どこを読んでいたか分からなくなってしまう可能性があります。

source: However, this book is not about you; it’s about your audience.
ja: しかし、本書は開発者のための本ではなく、ユーザーのための本です。

source: However, when the content you are serving is static and intended for reading alone, relying on client-side JavaScript to render that content is an underperforming and relatively unreliable method.
ja: しかし、コンテンツが静的で、読ませることだけが目的なら、クライアントサイドJavaScriptでコンテンツを表示するのは非効率で、比較的信頼性の低い方法です。

source: I gave up on home printers a long time ago because they always seemed to break after ten minutes of use.
ja: 10分も使うと必ず壊れるような家庭用プリンターには、とうの昔に見切りをつけました。

source: I see no reason why poor readability should not also be considered a point of failure.
ja: 読みやすさが劣るという理由でビルドが失敗するようにすることを、避けるべき理由はないように思います。

source: Ideally, the underline should not intersect the form of descenders but leave space for them.
ja: できればアンダーラインはディセンダと交差せず、間隔が空いているのが理想です。

source: Identifying External Links
ja: 外部リンクを特定する

source: If JavaScript is entirely unavailable, the CSS is loaded regardless, thanks to <noscript>.
ja: JavaScriptがまったく使えない場合でも、<noscript>があるおかげで、とりあえずCSSは読み込まれます。

source: If JavaScript was used to construct the content in the client, all I would see is the code for the outer web page, with its link(s) to the JavaScript which curl is unable to run.
ja: JavaScriptによってクライアントでコンテンツを構築しているケースでは、curlが実行できないJavaScriptへのリンクを含んだWebページの外枠のコードだけが表示されることになります。

source: If a browser fails to load your style sheet, it will still differentiate key elements of the interface using its own default user agent style sheet.
ja: ブラウザがスタイルシートの読み込みに失敗しても、ユーザーエージェントのデフォルトスタイルシートが適用されて、インターフェイスの主要な要素は認識できるようになります。

source: If poor code style like inconsistent indentation breaks a build, that’s one thing; but if a build breaks because the product is in danger of alienating a user?
ja: インデントが一貫していないなど、望ましくないコーディングスタイルでビルドが止まるというのは、よくあるやり方です。では、製品がユーザーを疎外する危険性がある、という理由でビルドが止まるとしたらどうでしょう？

source: If the doctype tells the browser what kind of document it is serving (HTML5 in the above example), then the <html> element’s lang attribute tells it which language it is written in.
ja: DOCTYPEでドキュメントの種類をブラウザに伝えたら（HTML5なら上の例のようになります）、次は<html>要素のlang属性でドキュメントの言語を指定します。

source: If the user has gone to Settings → Content in Firefox and set the default font size to 20px, 2rem will mean 2 × 20 — or 40px.
ja: ユーザーがFirefoxの［オプション］→［コンテンツ］でデフォルトのフォントサイズを20pxに設定している場合は、2remは20×2、つまり40pxを意味します。

source: If things get plain odd when testing a web page, I always check for a doctype before trying anything else.
ja: Webページのテスト時におかしなことが起きたら、私はまっさきにDOCTYPEを確認します。

source: If we want “In Seven Easy Steps” to be part of the title, we can separate it with a semantically inert <span> element and drop it onto a new line using h1 span { display: block; }.
ja: 「～シンプルな7つのステップで～」をタイトルの一部にしたい場合は、特別な意味を持たない<span>要素でこれを区切り、h1 span{ display:block;}を使用して改行することができます。

source: If you are serving your own fonts, you can first subset them using Font Squirrel’s generator9.
ja: 独自のフォントを使用する場合は、まずFont Squirrelのジェネレータ（脚注12）を使ってフォントをサブセット化します。

source: If you end up in the unfortunate position that colors were chosen without recourse to contrast accessibility, tools like Color Contrast Analyser13 can help you identify problem areas.
ja: 残念ながらコントラストのアクセシビリティを考慮せずに色が選択されてしまった場合、Color Contrast Analyser（脚注27）などのツールを使えば問題のある領域を特定するのに役立つでしょう。

source: If you work as a front-end engineer, you are no doubt familiar with the virtues of modular design.
ja: フロントエンドエンジニアとして働く人は、間違いなくモジュール設計の利点に慣れ親しんでいます。

source: If your layout breaks badly when a user zooms, the design is at fault, not the user, and removing their ability to zoom is not a solution.
ja: ユーザーが拡大縮小したときにレイアウトが崩れてしまうとしたら、悪いのはユーザーではなくデザインです。拡大縮小できないようにしたところで解決にはなりません。

source: If your navigation, header, footer and sidebar (<aside>) regions are correctly made the siblings of <main>, you can target them quite easily with CSS:
ja: ナビゲーション、ヘッダー、フッター、サイドバー（<aside>）の領域がきちんと<main>の兄弟要素になっていれば、CSSでそれらをターゲットに指定するのは非常に簡単です。

source: If you’ll excuse the pun, I’ve struggled to justify using justified text on many occasions because I just like the way it looks.
ja: ダジャレのようで申し訳ありませんが、私は均等割り付け（justification）の見た目が好きで、これを何度も正当化（justify）しようと試みてきました。

source: If you’re building a highly complex layout, a grid system may help you.
ja: 非常に複雑なレイアウトを構築するのであれば、グリッドシステムは役に立つかもしれません。

source: If you’re going to get something right from the outset make it the content, not the typography, layout or color scheme.
ja: 根本から正しいものを作ろうとするのであれば、タイポグラフィでもレイアウトでもカラースキームでもなく、しっかりとしたコンテンツを作ってください。

source: Improved Link Underlines
ja: 改良したリンクのアンダーライン

source: In an experimental study carried out in Spain6 (PDF) which investigated the readability of different fonts to dyslexic people, a typeface designed specifically for dyslexic readers performed very poorly.
ja: スペインで実施された、ディスレクシアの人々に対する各種フォントの読みやすさを調査した実験的研究（脚注20）（PDF）では、ディスレクシアの読者専用にデザインされた書体の成績が非常に悪いという結果になりました。

source: In Keith Clark’s example6, <link> has an onload handler which switches the media type from none to all.
ja: キース・クラーク（Keith Clark）の例（脚注9）では、<link>のonloadハンドラでメディアタイプをnoneからallに切り替えています。

source: In my informal research into screen reader users’ behaviors and preferences2, some respondents were familiar and comfortable with landmark (region) navigation, but the majority used headings to get around.
ja: 私が行った、スクリーンリーダーユーザーの行動および好みに関する非公式の研究（脚注37）では、一部の回答者はランドマーク（リージョン）ナビゲーションを使いこなしていたものの、大半の回答者は見出しを使って移動していました。

source: In Brad Frost’s atomic design terminology1, a paragraph would be an atom: an indivisible building block with which complex patterns (molecules, organisms and pages) are created.
ja: ブラッド・フロスト（Brad Frost）のアトミックデザイン（脚注16）では、パラグラフ（段落）は原子にあたります。複雑なパターン（分子、有機体、ページ）を作成するための、これ以上分割できない基本単位です。

source: In CSS this can be expressed using the line-height property.
ja: CSSでは、line-heightプロパティで指定することができます。

source: In CSS, 1rem roughly corresponds to the width of the typeface’s lowercase m, so a paragraph which is 60rem wide could be said to have a measure of 60 — nicely within range for comfort.
ja: CSSでは、1remが書体の小文字mの幅にほぼ該当します。このため、幅が60remのパラグラフはカラム幅が60字分であると言うことができ、ちょうど読みやすい幅に収まります。

source: In Robert Bringhurst’s book The Elements of Typographic Style, he recommends a measure between 45 and 75 characters.
ja: ロバート・ブリングハースト（Robert Bringhurst）は著書『The Elements of Typographic Style』の中で、カラム幅を45～75文字にすることを推奨しています。

source: In a non-visual context, this would not be apparent: Traversing from the to the <p> would have a screen reader believe that they had begun reading the article body.
ja: 非視覚的なコンテキストでは、このことはわかりません。 から<p>へと移り変わることで、スクリーンリーダーは、記事の本文を読み始めたと考えるでしょう。

source: In a progressively enhanced setup, scripts should be inserted at the end of the document, just before the closing </body> tag.
ja: プログレッシブエンハンスメントのセットアップでは、スクリプトはドキュメントの最後、終了タグ</body>の直前に入れるべきです。

source: In a single-page application, your singular <main> should be where each of your functionality-heavy views is rendered.
ja: シングルページアプリケーションの場合、ひとつの<main>で、さまざまな機能が盛り込まれた各ビューをレンダリングすることになるでしょう。

source: In a static blog or brochure website, <main> would contain blog posts and other informational content.
ja: 静的なブログやパンフレットの<main>には、ブログのポストやその他の情報コンテンツが含まれます。

source: In addition to screen readers and computer braille displays benefiting from proper language declaration, it also helps browsers choose and render system fonts with the appropriate character sets.
ja: 適切な言語が明示されていれば、スクリーンリーダーや点字ディスプレイにとって有益ですし、さらに、ブラウザが適切な文字セットを含むシステムフォントを選択することもできるようになります。

source: In addition, services that syndicate your content, such as feed readers, will be able to apply their own structural styles, enabling a comfortable reading experience within their own applications.
ja: さらに、フィードリーダーなどのコンテンツをまとめるサービスでは、独自のスタイルを適用し、それぞれのアプリケーション内で読みやすくすることができます。

source: In addition, the omission of the aforementioned doctype declaration can result in unexpected and broken behavior for users.
ja: その上、前述したDOCTYPE宣言を省略してしまうと、ユーザーにとって予期せぬ異常な動作が生じる可能性があります。

source: In all cases, whether I’m applying visual design, writing JavaScript behavior or structuring content, I ask who benefits from the way I’m approaching it.
ja: 視覚的なデザインに取り組むときも、JavaScriptの動作を記述するときも、コンテンツを構築するときも、私はそのやり方で恩恵を受けるのは誰かを必ず考えます。

source: In an informal poll I took on Twitter asking my followers about the biggest mistakes designers make regarding inclusion, the suppression of pinch-zoom on handheld devices was by far the most cited.
ja: 私がTwitterでフォロワーを対象に行った、デザイナーが犯すインクルージョン関連の最大のミスは何か？という調査では、「携帯端末でピンチによる拡大縮小を禁止している」が群を抜いて1位でした。

source: In any case, low-contrast combinations of text and background colors should be avoided.
ja: どちらにしても、テキストと背景の色のコントラストを低くするのは避けるべきです。

source: In conventional web page anatomy, this content is designated to a main content area.
ja: このようなコンテンツは、慣習的なWebページ構造では、メインコンテンツの領域に割り当てられます。

source: In defeating FOIT, you have to accept a lesser evil called FOUT (flash of unstyled text).
ja: FOITを避けるためには、FOUT (Flash of Unstyled Text) と呼ばれる、比較的軽微な問題を許容する必要があります。

source: In desktop publishing, this issue is mitigated by hyphenation: breaking up larger words to redistribute them more evenly.
ja: デスクトップパブリッシングでは、ハイフネーションでこの問題を軽減できます。長い単語を分割し、より均等に再割り付けするのです。

source: In general, I recommend against dealing with third-party grid systems.
ja: 一般的なケースでは、サードパーティのグリッドシステムを使うことはおすすめできません。

source: In her talk “Burn Your Select Tags8” (video), Alice Bartlett shares the research she undertook at the UK Government Digital Service9 into <select> element usability.
ja: アリス・バートレット（Alice Bartlett）は、「Burn Your Select Tags（脚注43）」（ビデオ）の中で、UK Government Digital Service（脚注44）で彼女が行った<select>要素のユーザービリティの調査について話しています。

source: In later chapters, we’ll call on .visually-hidden a number of times.
ja: .visually-hiddenは後の章でも何度か出てきます。

source: In my CSS I can select any sections declared as French using the :lang pseudo-class, applying a font well suited to the French character set, thereby improving legibility:
ja: CSSの:lang擬似クラスを使えば、フランス語が指定されている全てのセクションを選択し、フランス語に適したフォントを適用して読みやすくすることができます。

source: In my opinion, the most effective blog designs are spartan, focusing on content and removing as many distractions as possible.
ja: 個人的な意見ですが、最も効果的なブログのデザインは、コンテンツを中心とし、じゃまなものはできる限り取り除いた質素なデザインです。

source: In other words, Opera Mini would display the body text as it would have liked to begin with.
ja: 言い換えれば、Opera Miniでは、ユーザーがあらかじめ設定しているお好みのサイズで本文テキストが表示されるということです。

source: In other words, being cryptic or whimsical doesn’t get you very far!
ja: 言い換えれば、もったいぶったり、風変わりにしたりしても、誰も幸せにならないということです!

source: In other words, you avoid a “Where the hell am I?” moment.
ja: つまり、「いったい今どこにいるんだ？」という状態を避けるということです。

source: In particular, FOIT (flash of invisible text) should be avoided: if the font resource is indefinitely stalled (it happens!), users of some devices and browsers will be stuck with a page that has no visible text.
ja: 特にFOIT（Flash of Invisible Text）は避けた方が賢明です。フォントのリソースがいつまでも読み込まれないと（実際よくあることです！）、デバイスやブラウザによってはページのテキストが全く表示されない状態で止まってしまいます。

source: In practice, this means a well-matched system font can supply the more unusual characters, allowing you to heavily subset the web font.
ja: 実際のところ、システムフォントは多くの文字にマッチし、普段あまり使われない文字も提供できます。そのため、Webフォントを大幅にサブセット化しても問題ないというわけです。

source: In print design, where the relative position of grid elements is reliable and consistent, you can rely on juxtaposition to convey meaning and use terminology like, “the photograph to the right.” On the responsive web, you don’t have this luxury.
ja: 印刷デザインでは、グリッドに沿った要素の相対位置には信頼性と一貫性があるため、意味を伝えるために横に並べて配置したり、「右の写真」といった言い方をしたりできます。レスポンシブWebには、このような贅沢はできません。

source: In short:
ja: つまりこういうことです。

source: In terms of our document setup, it’s critical we make sure the resources we are using to enhance the page content do not stand in the way of that content.
ja: ドキュメントのセットアップという観点では、ページのコンテンツを強化するためのリソースが逆にコンテンツの妨げにならないようにすることが重要です。
